Tekla.Structures.Drawing.ReinforcementBase.ReinforcementRepresentationTypes
The available reinforcement representation types.
See Tekla Structures help, "Reinforcement appearance", for more information.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementRepresentationTypes.SingleLine
A single line with radiused bends.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementRepresentationTypes.DoubleLine
The outline of a bar with radiused bends.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementRepresentationTypes.Filled
A solid bar with radiused bends.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementRepresentationTypes.Stick
A single line without radiused bends.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementRepresentationTypes.OutLine
Shows the shape of the mesh using an outline rectangle or polygon, and a diagonal line.
Only applies to reinforcement meshes.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementRepresentationTypes.DoubleLineFilledEnds
The outline of a bar with radiused bends and filled bar ends.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementRepresentationTypes.SingleLineFilledEnds
A single line with radiused bends and filled bar ends.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementRepresentationTypes.OutlineIgnoreHoles
Shows the shape of the mesh using an outline rectangle or polygon, and a diagonal line. It ignores the holes in the meshes.
Only applies to reinforcement meshes.